#include <stdio.h>
#include <stdlib.h>
#include <locale.h>
int main()
{
    int a = 11;
    int b = 3;
    // int x = a / b;
    // float y = a / b;
    // double z = a / b;
    // printf("x = %d, y = %f, z = %e", x, y, z); поскольку int x принимает только целое значение, а результат получается дробным, он выводит нули.
    printf("Тип float a/b: %f, тип double a/b: %e", (float)a / b, (double)a / b); // Преобразование типа работает до деления, поэтому деление становится вещественным.
    printf("Тип float a/b: %f, тип double a/b: %e", (float)(a / b), (double)(a / b)); // Благодаря скобкам мы изменили приоритет операций, сначала выполняется целочисленное деление, а потом преобразование типа
    printf("Тип float a/b: %f, тип double a/b: %e", a / (float)b, a / (double)b); // Здесь результат не меняется как в первом случае, потому что целое число b преобразуется в вещественное и благодаря этому автоматически преобразуется и переменная a
    system("pause");
    return 0;
}