#include <stdio.h>
#include <stdlib.h>

void name()
{
    puts("***********************************************************************************");
    puts("*                                                                                 *");
    puts("* тема: Написание и компиляция консольного приложения в среде разработки MVS 2022 *");
    puts("*                                                                                 *");
    puts("*    Выполнил Ухов Д.В., группа бОТИ-262                                          *");
    puts("*                                                                                 *");
    puts("***********************************************************************************");
}

void date()
{
    puts("_      _   _    _   _ ");
    puts("_| |  | | |_   | | |_|");
    puts("_| |  |_|  _|  |_| |_|");
}

int main()
{
    name();
    date();
    return 0;
}