#include <stdio.h>
#include <locale.h>

int main()
{
    setlocale(LC_CTYPE, "RUS");
    puts("***********************************************************************************");
    puts("*                                                                                 *");
    puts("* тема: Написание и компиляция консольного приложения в среде разработки MVS 2022 *");
    puts("*                                                                                 *");
    puts("*    Выполнил Ухов Д.В., группа бОТИ-262                                          *");
    puts("*                                                                                 *");
    puts("***********************************************************************************");

    return 0;
}